#### create BigQuery Dataset "datamart"

In [1]:
!bq --location=US mk --dataset datamart

Dataset 'lunar-analyzer-302702:datamart' successfully created.

### Transform the COVID-19 Dataset

#### create preliminary covid table

In [42]:
%%bigquery
CREATE OR REPLACE TABLE datamart.covid AS
SELECT null AS id, fips, admin2, province_state, country_region AS Country, last_update, latitude, longitude, confirmed, deaths, recovered, active, combined_key, incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_winter2020
UNION ALL
SELECT null AS id, fips, admin2, province_state, country_region AS Country, last_update, latitude, longitude, confirmed, deaths, recovered, active, combined_key, incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_spring2020
UNION ALL
SELECT null AS id, fips, admin2, province_state, country_region AS Country, CAST(last_update AS STRING) AS last_update, lat AS latitude, long_ AS longitude, confirmed, deaths, recovered, active, combined_key, incidence_rate AS incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_summer2020
UNION ALL
SELECT null AS id, fips, admin2, province_state, country_region AS Country, CAST(last_update AS STRING) AS last_update, lat AS latitude, long_ AS longitude, confirmed, deaths, recovered, active, combined_key, incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_fall2020
UNION ALL
SELECT null AS id, fips, admin2, province_state, country_region AS Country, CAST(last_update AS STRING) AS last_update, lat AS latitude, long_ AS longitude, confirmed, deaths, recovered, active, combined_key, incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_winter2021
UNION ALL
SELECT null AS id, fips, admin2, province_state, country_region AS Country, CAST(last_update AS STRING) AS last_update, lat AS latitude, long_ AS longitude, confirmed, deaths, recovered, active, combined_key, incident_rate, case_fatality_ratio
FROM jhu_daily_reports_staging.covid_spring2021

Empty DataFrame
Columns: []
Index: []

#### compute fingerprint ids for preliminary covid table

In [43]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(country)
WHERE province_state IS null

Empty DataFrame
Columns: []
Index: []

In [44]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(concat(province_state, country))
WHERE (province_state IS NOT null AND country!='US')

Empty DataFrame
Columns: []
Index: []

In [46]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(concat(admin2, province_state, country))
WHERE (province_state IS NOT null AND country='US' AND admin2 IS NOT null AND fips IS NULL)

Empty DataFrame
Columns: []
Index: []

In [48]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(concat(CAST(fips AS STRING), admin2, province_state, country))
WHERE (province_state IS NOT null AND country='US' AND admin2 IS NOT null AND fips IS NOT null)

Empty DataFrame
Columns: []
Index: []

In [50]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(concat(CAST(fips AS STRING), province_state, country))
WHERE (province_state IS NOT null AND country='US' AND admin2 IS null AND fips IS NOT null)

Empty DataFrame
Columns: []
Index: []

In [52]:
%%bigquery
UPDATE datamart.covid
SET id=FARM_FINGERPRINT(concat(province_state, country))
WHERE (province_state IS NOT null AND country='US' AND admin2 IS null AND fips IS null)

Empty DataFrame
Columns: []
Index: []

#### check that there is no null id field in the preliminary covid table

In [53]:
%%bigquery
SELECT count(*) AS null_id_count
FROM datamart.covid
WHERE id IS null

   null_id_count
0              0

#### sample preliminary covid table

In [54]:
%%bigquery
SELECT *
FROM datamart.covid
ORDER BY province_state, country
LIMIT 5

,id,fips,admin2,province_state,Country,last_update,latitude,longitude,confirmed,deaths,recovered,active,combined_key,incident_rate,case_fatality_ratio
0,8576431891811451300,NaN,None,None,Azerbaijan,2020-02-28 15:03:26,NaN,NaN,1,0,0,NaN,None,NaN,NaN
1,8778414404485170876,NaN,None,None,Afghanistan,2020-10-13 04:24:02+00,33.93911,67.709953,39870,1481,33118,5273.0,Afghanistan,102.418955,3.709556
2,8778414404485170876,NaN,None,None,Afghanistan,2020-12-24 05:23:04+00,33.93911,67.709953,50433,2117,39692,8624.0,Afghanistan,129.553427,4.197648
3,8778414404485170876,NaN,None,None,Afghanistan,2020-09-05 04:28:19+00,33.93911,67.709953,38304,1410,29713,7182.0,Afghanistan,98.396179,3.678467
4,8778414404485170876,NaN,None,None,Afghanistan,2021-03-29 04:28:35+00,33.93911,67.709953,56294,2470,50013,3811.0,Afghanistan,144.609296,4.387679

### Transforms for table locations

#### create locations_raw table

In [55]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Locations_raw AS
SELECT DISTINCT id, fips, admin2, province_state, country, latitude, longitude, combined_key
FROM datamart.covid

Empty DataFrame
Columns: []
Index: []

#### show rows that have city,state in province_state column of the locations_raw table

In [56]:
%%bigquery
SELECT id, fips, admin2, province_state, strpos(province_state, ',') AS index, country, latitude, longitude, combined_key
FROM datamart.Locations_raw
WHERE strpos(province_state, ',') > 0
LIMIT 10

,id,fips,admin2,province_state,index,country,latitude,longitude,combined_key
0,8145114016361068042,NaN,None,"Tempe, AZ",6,US,33.4255,-111.9400,None
1,8145114016361068042,NaN,None,"Tempe, AZ",6,US,NaN,NaN,None
2,8556287708025666455,NaN,None,"Boston, MA",7,US,NaN,NaN,None
3,8556287708025666455,NaN,None,"Boston, MA",7,US,42.3601,-71.0589,None
4,-1673719292839792409,NaN,None,"Orange, CA",7,US,NaN,NaN,None
5,-1673719292839792409,NaN,None,"Orange, CA",7,US,33.7879,-117.8531,None
6,7702389166849437576,NaN,None,"Travis, CA",7,US,NaN,NaN,None
7,2904588917003491558,NaN,None,"Ashland, NE",8,US,NaN,NaN,None
8,8162844378884388227,NaN,None,"Chicago, IL",8,US,41.8781,-87.6298,None
9,8162844378884388227,NaN,None,"Chicago, IL",8,US,NaN,NaN,None

#### standardize city, state in the locations_raw table into table locations_city

In [57]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Locations_city AS
SELECT id, fips, admin2, split(province_state, ',')[offset(0)] AS city, split(province_state, ',')[offset(1)] AS state, country, latitude, longitude, combined_key
FROM datamart.Locations_raw
WHERE strpos(province_state, ',') > 0

Empty DataFrame
Columns: []
Index: []

#### create locations table (if error, try CAST(null AS string) AS City

In [58]:
%%bigquery
CREATE OR REPLACE TABLE datamart.locations AS
(SELECT id, fips, admin2, city, state, country, latitude, longitude, combined_key
FROM datamart.Locations_city
UNION ALL
SELECT id, fips, admin2, null AS City, province_state AS State, country, latitude, longitude, combined_key
FROM datamart.Locations_raw
WHERE strpos(province_state, ',') = 0
UNION ALL
SELECT id, fips, admin2, null AS City, province_state AS State, country, latitude, longitude, combined_key
FROM datamart.Locations_raw
WHERE province_state IS null
)

Empty DataFrame
Columns: []
Index: []

#### Ensure no rows were lost

In [59]:
%%bigquery
SELECT count(*) AS locations_raw_count, (SELECT count(*) FROM datamart.locations) AS locations_count
FROM datamart.Locations_raw

   locations_raw_count  locations_count
0                 5637             5637

In [72]:
%%bigquery
CREATE OR REPLACE TABLE datamart.locations AS
SELECT id, fips, admin2, city, state, country, latitude, longitude, combined_key
FROM
    (SELECT *, rank() over (partition by id, country ORDER BY latitude DESC, longitude DESC, combined_key DESC) AS rank
    FROM datamart.locations)
WHERE rank = 1

Empty DataFrame
Columns: []
Index: []

#### PK check: if same number then no duplicates

In [73]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.locations) AS locations_count
FROM (
    SELECT DISTINCT id
    FROM datamart.locations
)

   distinct_PK  locations_count
0         4413             4413

### Transforms for table cases

#### create Cases_raw table from preliminary covid table

In [78]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Cases_raw AS
SELECT id AS location_id, last_update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM datamart.covid

Empty DataFrame
Columns: []
Index: []

#### sample distinct dates in cases_raw table

In [79]:
%%bigquery
SELECT DISTINCT last_update
FROM datamart.Cases_raw
LIMIT 10

              last_update
0  2020-12-23 05:22:03+00
1  2021-02-22 05:24:21+00
2  2020-10-16 04:24:01+00
3  2021-03-03 05:23:28+00
4  2020-11-14 05:25:37+00
5  2020-08-14 04:51:19+00
6  2020-09-25 04:23:00+00
7  2020-07-06 04:33:57+00
8  2020-10-28 04:24:39+00
9  2021-01-30 05:22:49+00

In [80]:
%%bigquery
SELECT DISTINCT last_update
FROM datamart.Cases_raw
ORDER BY last_update
LIMIT 10

     last_update
0  1/22/20 17:00
1  1/23/20 17:00
2  1/24/20 17:00
3  1/25/20 17:00
4  1/26/20 16:00
5  1/27/20 23:59
6  1/28/20 23:00
7  1/29/20 19:30
8  1/30/20 16:00
9  1/31/20 10:37

#### create Cases_hypen_date_fixed

In [81]:
%%bigquery
SELECT last_update
FROM datamart.Cases_raw
WHERE strpos(last_update, '-') > 0 AND strpos(last_update, ' ') > 0 AND strpos(last_update, '+') = 0
LIMIT 15

            last_update
0   2020-03-15 18:20:18
1   2020-03-18 13:13:15
2   2020-03-20 20:13:15
3   2020-03-11 20:00:00
4   2020-02-07 23:43:02
5   2020-03-14 11:33:06
6   2020-03-14 20:13:16
7   2020-02-29 12:13:10
8   2020-02-06 23:23:02
9   2020-03-16 19:13:13
10  2020-03-20 07:43:02
11  2020-03-02 15:03:23
12  2020-03-18 14:53:05
13  2020-03-21 17:43:03
14  2020-03-18 14:13:56

In [82]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Cases_hyphen_date_fixed AS
SELECT location_id, CAST(last_update AS DATETIME) AS last_update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM datamart.Cases_raw
WHERE strpos(last_update, '-') > 0 AND strpos(last_update, ' ') > 0 AND strpos(last_update, '+') = 0

Empty DataFrame
Columns: []
Index: []

#### create Cases_plus_date_fixed

In [83]:
%%bigquery
SELECT last_update
FROM datamart.Cases_raw
WHERE strpos(last_update, '-') > 0 AND strpos(last_update, ' ') > 0 AND strpos(last_update, '+') > 0
LIMIT 15

               last_update
0   2020-12-23 05:22:03+00
1   2021-02-22 05:24:21+00
2   2020-10-16 04:24:01+00
3   2021-03-03 05:23:28+00
4   2020-11-14 05:25:37+00
5   2020-08-14 04:51:19+00
6   2020-09-25 04:23:00+00
7   2020-07-06 04:33:57+00
8   2020-10-28 04:24:39+00
9   2021-01-30 05:22:49+00
10  2020-10-12 04:23:45+00
11  2020-09-27 04:23:00+00
12  2021-04-09 04:21:13+00
13  2021-04-02 04:20:36+00
14  2021-03-03 05:23:28+00

In [84]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Cases_plus_date_fixed AS
SELECT location_id,CAST(CAST(last_update AS TIMESTAMP) AS DATETIME) AS last_update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM datamart.Cases_raw
WHERE strpos(last_update, '-') > 0 AND strpos(last_update, ' ') > 0 AND strpos(last_update, '+') > 0

Empty DataFrame
Columns: []
Index: []

#### create Cases_slash_date

In [85]:
%%bigquery
SELECT DISTINCT last_update
FROM datamart.Cases_raw
WHERE strpos(last_update, '/') > 0
LIMIT 15

      last_update
0    5/30/20 2:32
1     6/1/20 2:32
2    5/31/20 2:32
3    5/12/20 3:32
4    5/19/20 2:32
5     5/4/20 2:32
6   4/17/20 23:30
7    5/28/20 2:32
8    5/20/20 2:32
9    5/26/20 2:32
10    5/8/20 2:32
11    5/5/20 2:32
12    4/5/20 2:06
13  4/20/20 23:36
14  4/21/20 23:30

In [86]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Cases_slash_date AS
SELECT * 
FROM datamart.Cases_raw
WHERE strpos(last_update, '/') > 0

Empty DataFrame
Columns: []
Index: []

#### check Cases_slash_date for their year format

In [87]:
%%bigquery
SELECT last_update, length(split(split(last_update, ' ')[offset(0)], '/')[offset(2)]) AS year_num_digits
FROM (
    SELECT DISTINCT last_update
    FROM datamart.Cases_slash_date)
LIMIT 10

     last_update  year_num_digits
0  1/22/20 17:00                2
1  1/23/20 17:00                2
2  1/24/20 17:00                2
3    5/1/20 2:32                2
4    5/2/20 2:32                2
5    5/3/20 2:32                2
6    5/4/20 2:32                2
7    5/5/20 2:32                2
8    5/6/20 2:32                2
9    5/7/20 2:32                2

#### create Cases_slash_date_fixed

In [88]:
%%bigquery
CREATE OR REPLACE TABLE datamart.Cases_slash_date_fixed AS
(SELECT location_id, PARSE_DATETIME('%m/%d/%y %H:%M', last_update) AS Last_Update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM datamart.Cases_slash_date 
WHERE length(split(split(last_update, ' ')[offset(0)], '/')[offset(2)]) = 2
UNION ALL
SELECT location_id, PARSE_DATETIME('%m/%d/%Y %H:%M', last_update) AS Last_Update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM datamart.Cases_slash_date 
WHERE length(split(split(last_update, ' ')[offset(0)], '/')[offset(2)]) = 4
)

Empty DataFrame
Columns: []
Index: []

#### sample Cases_slash_date_fixed for fixed dates

In [89]:
%%bigquery
SELECT * 
FROM (
    SELECT DISTINCT last_update
    FROM datamart.Cases_slash_date_fixed)
ORDER BY last_update
LIMIT 10

          last_update
0 2020-01-22 17:00:00
1 2020-01-23 17:00:00
2 2020-01-24 17:00:00
3 2020-01-25 17:00:00
4 2020-01-26 16:00:00
5 2020-01-27 23:59:00
6 2020-01-28 23:00:00
7 2020-01-29 19:30:00
8 2020-01-30 16:00:00
9 2020-01-31 08:15:00

#### create cases table

In [90]:
%%bigquery
CREATE OR REPLACE TABLE datamart.cases AS
(SELECT * 
FROM datamart.Cases_hyphen_date_fixed
UNION ALL
SELECT *
FROM datamart.Cases_plus_date_fixed
UNION ALL
SELECT *
FROM datamart.Cases_slash_date_fixed
)

Empty DataFrame
Columns: []
Index: []

#### ensure no rows were lost

In [91]:
%%bigquery
SELECT count(*) AS cases_raw_count, (SELECT count(*) FROM datamart.cases) AS cases_count
FROM datamart.Cases_raw

   cases_raw_count  cases_count
0          1657069      1657068

#### remove duplicate cases

In [92]:
%%bigquery
CREATE OR REPLACE TABLE datamart.cases AS
SELECT DISTINCT *
FROM datamart.cases

Empty DataFrame
Columns: []
Index: []

#### get cases count after first attempt of removing duplicates

In [93]:
%%bigquery
SELECT count(*) AS distinct_cases_count
FROM datamart.cases

   distinct_cases_count
0               1476173

#### check if there a still duplicate cases

In [94]:
%%bigquery
SELECT location_id, last_update, count(*) AS duplicate_cases
FROM datamart.cases
GROUP BY location_id, last_update
HAVING count(*) > 1
ORDER BY count(*) DESC
LIMIT 10

           location_id         last_update  duplicate_cases
0  3183797238637395852 2021-04-02 15:13:53              146
1 -1181716864917925688 2021-04-02 15:13:53              111
2  2231787937947570706 2020-12-21 13:27:30               92
3  8778414404485170876 2020-03-17 11:53:10                3
4  8778414404485170876 2020-02-24 23:33:02                3
5  -391570144277816991 2020-03-14 22:33:04                2
6  8009782315755301025 2020-08-04 02:27:56                2
7  7612477503619687113 2020-02-13 17:53:03                2
8  7612477503619687113 2020-02-17 07:33:02                2
9  7430223413705102985 2020-03-14 20:13:16                2

#### remove duplicates based on confirmed, deaths, and recovered cases

In [95]:
%%bigquery
CREATE OR REPLACE TABLE datamart.cases AS
SELECT location_id, last_update, confirmed, deaths, recovered, active, incident_rate, case_fatality_ratio
FROM(SELECT *, rank() over (partition by location_id, last_update order by confirmed DESC, deaths DESC, recovered DESC ) as rank
FROM datamart.cases)
WHERE rank = 1

Empty DataFrame
Columns: []
Index: []

#### PK check: if same number then no duplicates

In [96]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.cases) AS cases_count
FROM (
    SELECT DISTINCT location_id, last_update
    FROM datamart.cases
)

   distinct_PK  cases_count
0      1475767      1475767

#### FK check

In [97]:
%%bigquery
SELECT count(*) AS foreign_key_violations
FROM datamart.cases AS c
LEFT JOIN datamart.locations AS l ON c.location_id=l.id
WHERE l.id IS null

   foreign_key_violations
0                       0

### Transform the ACS Dataset

### Transforms for table demographics

#### create demo_temp

In [5]:
%%bigquery
CREATE OR REPLACE TABLE datamart.demo_temp AS
SELECT 'US' AS country, null AS category, null AS subcategory1, null AS subcategory2, TRIM(_Label_) AS label, CAST(United_States__Estimate AS NUMERIC) AS estimate, REGEXP_REPLACE(United_States__Margin_of_Error, '[^0-9.]', '') AS error_margin, REGEXP_REPLACE(United_States__Percent, '[^0-9.]', '') AS percent, REGEXP_REPLACE(United_States__Percent_Margin_of_Error, '[^0-9.]', '') AS error_margin_percent
FROM us_census_bureau_staging.acs_demographics

Empty DataFrame
Columns: []
Index: []

#### update blank strings to nulls

In [6]:
%%bigquery
UPDATE datamart.demo_temp
SET error_margin=null
WHERE error_margin=''

Empty DataFrame
Columns: []
Index: []

In [7]:
%%bigquery
UPDATE datamart.demo_temp
SET error_margin_percent=null
WHERE error_margin_percent=''

Empty DataFrame
Columns: []
Index: []

In [8]:
%%bigquery
UPDATE datamart.demo_temp
SET percent=null
WHERE percent=''

Empty DataFrame
Columns: []
Index: []

#### create table demographics

In [34]:
%%bigquery
CREATE OR REPLACE TABLE datamart.demographics AS
SELECT country, CAST(category AS STRING) AS category, CAST(subcategory1 AS STRING) AS subcategory1, CAST(subcategory2 AS STRING) AS subcategory2, label, estimate, CAST(error_margin AS NUMERIC) AS error_margin, CAST(percent AS NUMERIC) AS percent, CAST(error_margin_percent AS NUMERIC) AS error_margin_percent
FROM datamart.demo_temp

Empty DataFrame
Columns: []
Index: []

#### remove non-data rows

In [35]:
%%bigquery
DELETE FROM datamart.demographics
WHERE estimate IS null AND error_margin IS null AND percent IS null AND error_margin IS null

Empty DataFrame
Columns: []
Index: []

#### update records with corresponding category and subcategory

In [36]:
%%bigquery
UPDATE datamart.demographics
SET category='general'
WHERE label IN ('Male', 'Female', 'Sex ratio (males per 100 females)', 'Total population', 'Under 5 years', '5 to 9 years', '10 to 14 years', '15 to 19 years', '20 to 24 years', '25 to 34 years', '35 to 44 years', '45 to 54 years', '55 to 59 years', '60 to 64 years', '65 to 74 years', '75 to 84 years', '85 years and over', 'Median age (years)', 'Under 18 years', '16 years and over', '18 years and over', '21 years and over', '62 years and over', '65 years and over', 'Total housing units', 'Citizen, 18 and over population')

Empty DataFrame
Columns: []
Index: []

In [37]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='sex'
WHERE (label='Male' AND estimate=159886919 AND error_margin=5817 AND percent=49.2)
OR (label='Female' AND estimate=164810876 AND error_margin=5818 AND percent=50.8)
OR (label='Sex ratio (males per 100 females)' AND estimate=97 AND error_margin=0.1)

Empty DataFrame
Columns: []
Index: []

In [38]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='age'
WHERE label IN ('Under 5 years', '5 to 9 years', '10 to 14 years', '15 to 19 years', '20 to 24 years', '25 to 34 years', '35 to 44 years', '45 to 54 years', '55 to 59 years', '60 to 64 years', '65 to 74 years', '75 to 84 years', '85 years and over', 'Median age (years)', 'Under 18 years', '16 years and over', '18 years and over', '21 years and over', '62 years and over', '65 years and over')
OR (label='Male' AND estimate=122360385)
OR (label='Female' AND estimate=128908018)
OR (label='Male' AND estimate=22518603)
OR (label='Female' AND estimate=28265193)
OR (label='Sex ratio (males per 100 females)' AND estimate=94.9 AND error_margin=0.1)
OR (label='Sex ratio (males per 100 females)' AND estimate=79.7 AND error_margin=0.1)

Empty DataFrame
Columns: []
Index: []

In [39]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='18 years and over'
WHERE (label='18 years and over')
OR (label='Male' AND estimate=122360385)
OR (label='Female' AND estimate=128908018)
OR (label='Sex ratio (males per 100 females)' AND estimate=94.9 AND error_margin=0.1)

Empty DataFrame
Columns: []
Index: []

In [40]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='65 years and over'
WHERE (label='65 years and over')
OR (label='Male' AND estimate=22518603)
OR (label='Female' AND estimate=28265193)
OR (label='Sex ratio (males per 100 females)' AND estimate=79.7 AND error_margin=0.1)

Empty DataFrame
Columns: []
Index: []

In [41]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='one race'
WHERE label IN ('One race', 'Cherokee tribal grouping', 'Chippewa tribal grouping', 'Navajo tribal grouping', 'Sioux tribal grouping', 'Asian Indian', 'Chinese', 'Filipino', 'Japanese', 'Korean', 'Vietnamese', 'Other Asian', 'Native Hawaiian', 'Guamanian or Chamorro', 'Samoan', 'Other Pacific Islander')
OR (label='White' AND estimate=235377662)
OR (label='Black or African American' AND estimate=41234642)
OR (label='American Indian and Alaska Native' AND estimate=2750143)
OR (label='Asian' AND estimate=17924209)
OR (label='Native Hawaiian and Other Pacific Islander' AND estimate=599868)
OR (label='Some other race' AND estimate=16047369)

Empty DataFrame
Columns: []
Index: []

In [42]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='American Indian and Alaska Native'
WHERE label IN ('Cherokee tribal grouping', 'Chippewa tribal grouping', 'Navajo tribal grouping', 'Sioux tribal grouping')
OR (label='American Indian and Alaska Native' AND estimate=2750143)

Empty DataFrame
Columns: []
Index: []

In [43]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='Asian'
WHERE label IN ('Asian Indian', 'Chinese', 'Filipino', 'Japanese', 'Korean', 'Vietnamese', 'Other Asian')
OR (label='Asian' AND estimate=17924209)

Empty DataFrame
Columns: []
Index: []

In [44]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='Native Hawaiian and Other Pacific Islander'
WHERE label IN ('Native Hawaiian', 'Guamanian or Chamorro', 'Samoan', 'Other Pacific Islander')
OR (label='Native Hawaiian and Other Pacific Islander' AND estimate=599868)

Empty DataFrame
Columns: []
Index: []

In [45]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='two or more races'
WHERE label IN ('White and Black or African American', 'White and American Indian and Alaska Native', 'White and Asian', 'Black or African American and American Indian and Alaska Native')
OR (label='Two or more races' AND estimate=10763902)

Empty DataFrame
Columns: []
Index: []

In [46]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='Race alone or in combination with one or more other races'
WHERE (label='White' AND estimate=244597669)
OR (label='Black or African American' AND estimate=45612523)
OR (label='American Indian and Alaska Native' AND estimate=5643919)
OR (label='Asian' AND estimate=21408058)
OR (label='Native Hawaiian and Other Pacific Islander' AND estimate=1399393)
OR (label='Some other race' AND estimate=17859236)

Empty DataFrame
Columns: []
Index: []

In [47]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='Hispanic or Latino'
WHERE label IN ('Hispanic or Latino (of any race)', 'Mexican', 'Puerto Rican', 'Cuban', 'Other Hispanic or Latino')

Empty DataFrame
Columns: []
Index: []

In [48]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='Not Hispanic or Latino'
WHERE label IN ('Not Hispanic or Latino', 'White alone', 'Black or African American alone', 'American Indian and Alaska Native alone', 'Asian alone', 'Native Hawaiian and Other Pacific Islander alone', 'Some other race alone','Two races including Some other race', 'Two races excluding Some other race, and Three or more races')
OR (label='Two or more races' AND estimate=7941608 AND error_margin=66801 AND percent=2.4)

Empty DataFrame
Columns: []
Index: []

In [49]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='Two or more races'
WHERE label IN ('Two races including Some other race', 'Two races excluding Some other race, and Three or more races')
OR (label='Two or more races' AND estimate=7941608 AND error_margin=66801 AND percent=2.4)

Empty DataFrame
Columns: []
Index: []

In [50]:
%%bigquery
UPDATE datamart.demographics
SET subcategory1='Citizen, 18 and over population'
WHERE (label='Citizen, 18 and over population')
OR (label='Male' AND estimate=112003359)
OR (label='Female' AND estimate=118956432)

Empty DataFrame
Columns: []
Index: []

In [51]:
%%bigquery
UPDATE datamart.demographics
SET subcategory2='sex'
WHERE (label='Male' AND estimate=112003359)
OR (label='Female' AND estimate=118956432)

Empty DataFrame
Columns: []
Index: []

In [52]:
%%bigquery
UPDATE datamart.demographics
SET category='race'
WHERE subcategory1 IN ('one race', 'two or more races', 'Race alone or in combination with one or more other races', 'Hispanic or Latino', 'Not Hispanic or Latino')

Empty DataFrame
Columns: []
Index: []

#### make fields null in percent column if they're not percentages

In [53]:
%%bigquery
UPDATE datamart.demographics
SET percent=null
WHERE estimate=percent

Empty DataFrame
Columns: []
Index: []

#### remove duplicate records

In [54]:
%%bigquery
CREATE OR REPLACE TABLE datamart.demographics AS
SELECT DISTINCT *
FROM datamart.demographics

Empty DataFrame
Columns: []
Index: []

In [55]:
%%bigquery
DELETE FROM datamart.demographics
WHERE (label='18 years and over' AND percent IS null)
OR (label='65 years and over' AND percent IS null)

Empty DataFrame
Columns: []
Index: []

#### remove housing record

In [99]:
%%bigquery
DELETE FROM datamart.demographics
WHERE label='Total housing units'

Empty DataFrame
Columns: []
Index: []

#### PK check: if same number then no duplicates

In [100]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.demographics) AS demographics_count
FROM (
    SELECT DISTINCT category, subcategory1, subcategory2, label
    FROM datamart.demographics
)

   distinct_PK  demographics_count
0           81                  81

### FK check

In [101]:
%%bigquery
SELECT count(*) AS foreign_key_violations
FROM datamart.demographics AS d 
LEFT JOIN datamart.locations AS l ON d.country=l.country
WHERE l.id IS null

   foreign_key_violations
0                       0

### Transforms for table housing

#### create housing_temp

In [24]:
%%bigquery
CREATE OR REPLACE TABLE datamart.housing_temp AS
SELECT 'US' AS country, null AS category, null AS subcategory, TRIM(_Label_) AS label, CAST(United_States__Estimate AS NUMERIC) AS estimate, REGEXP_REPLACE(United_States__Margin_of_Error, '[^0-9.]', '') AS error_margin, REGEXP_REPLACE(United_States__Percent, '[^0-9.]', '') AS percent, REGEXP_REPLACE(United_States__Percent_Margin_of_Error, '[^0-9.]', '') AS error_margin_percent
FROM us_census_bureau_staging.acs_housing

Empty DataFrame
Columns: []
Index: []

#### update blank strings to nulls

In [25]:
%%bigquery
UPDATE datamart.housing_temp
SET error_margin=null
WHERE error_margin=''

Empty DataFrame
Columns: []
Index: []

In [26]:
%%bigquery
UPDATE datamart.housing_temp
SET error_margin_percent=null
WHERE error_margin_percent=''

Empty DataFrame
Columns: []
Index: []

In [27]:
%%bigquery
UPDATE datamart.housing_temp
SET percent=null
WHERE percent=''

Empty DataFrame
Columns: []
Index: []

#### create table housing

In [26]:
%%bigquery
CREATE OR REPLACE TABLE datamart.housing AS
SELECT country, CAST(category AS STRING) AS category, CAST(subcategory AS STRING) AS subcategory, label, estimate, CAST(error_margin AS NUMERIC) AS error_margin, CAST(percent AS NUMERIC) AS percent, CAST(error_margin_percent AS NUMERIC) AS error_margin_percent
FROM datamart.housing_temp

Empty DataFrame
Columns: []
Index: []

#### remove non-data rows

In [53]:
%%bigquery
DELETE FROM datamart.housing
WHERE estimate IS null AND error_margin IS null AND percent IS null AND error_margin IS null

Empty DataFrame
Columns: []
Index: []

#### update records with corresponding category and subcategory

In [6]:
%%bigquery
UPDATE datamart.housing
SET category='housing units'
WHERE label IN ( 'Total housing units', 'Occupied housing units', 'Vacant housing units', 'Homeowner vacancy rate', 'Rental vacancy rate','1-unit, detached', '1-unit, attached','2 units', '3 or 4 units', '5 to 9 units', '10 to 19 units', '20 or more units', 'Mobile home', 'Boat, RV, van, etc.', 'Built 2014 or later', 'Built 2010 to 2013', 'Built 2000 to 2009', 'Built 1990 to 1999', 'Built 1980 to 1989', 'Built 1970 to 1979', 'Built 1960 to 1969', 'Built 1950 to 1959', 'Built 1940 to 1949', 'Built 1939 or earlier', '1 room','2 rooms', '3 rooms', '4 rooms', '5 rooms', '6 rooms', '7 rooms', '8 rooms', '9 rooms or more', 'Median rooms', 'No bedroom', '1 bedroom', '2 bedrooms', '3 bedrooms', '4 bedrooms', '5 or more bedrooms')

Empty DataFrame
Columns: []
Index: []

In [15]:
%%bigquery
UPDATE datamart.housing
SET subcategory='housing occupancy'
WHERE label IN ('Occupied housing units', 'Vacant housing units', 'Homeowner vacancy rate', 'Rental vacancy rate')

Empty DataFrame
Columns: []
Index: []

In [7]:
%%bigquery
UPDATE datamart.housing
SET subcategory='units in structure'
WHERE label IN ('1-unit, detached', '1-unit, attached','2 units', '3 or 4 units', '5 to 9 units', '10 to 19 units', '20 or more units', 'Mobile home', 'Boat, RV, van, etc.')

Empty DataFrame
Columns: []
Index: []

In [8]:
%%bigquery
UPDATE datamart.housing
SET subcategory='housing tenure'
WHERE label IN ('Owner-occupied', 'Renter-occupied', 'Average household size of owner-occupied unit', 'Average household size of renter-occupied unit')

Empty DataFrame
Columns: []
Index: []

In [29]:
%%bigquery
UPDATE datamart.housing
SET subcategory='built year'
WHERE label IN ('Built 2014 or later', 'Built 2010 to 2013', 'Built 2000 to 2009', 'Built 1990 to 1999', 'Built 1980 to 1989', 'Built 1970 to 1979', 'Built 1960 to 1969', 'Built 1950 to 1959', 'Built 1940 to 1949', 'Built 1939 or earlier')

Empty DataFrame
Columns: []
Index: []

In [30]:
%%bigquery
UPDATE datamart.housing
SET subcategory='rooms'
WHERE label IN ('1 room','2 rooms', '3 rooms', '4 rooms', '5 rooms', '6 rooms', '7 rooms', '8 rooms', '9 rooms or more', 'Median rooms')

Empty DataFrame
Columns: []
Index: []

In [31]:
%%bigquery
UPDATE datamart.housing
SET subcategory='bedrooms'
WHERE label IN ('No bedroom', '1 bedroom', '2 bedrooms', '3 bedrooms', '4 bedrooms', '5 or more bedrooms')

Empty DataFrame
Columns: []
Index: []

In [32]:
%%bigquery
UPDATE datamart.housing
SET category='occupied housing units'
WHERE label IN ('Owner-occupied', 'Renter-occupied', 'Average household size of owner-occupied unit', 'Average household size of renter-occupied unit', 'Moved in 2017 or later', 'Moved in 2015 to 2016', 'Moved in 2010 to 2014', 'Moved in 2000 to 2009', 'Moved in 1990 to 1999', 'Moved in 1989 and earlier', 'No vehicles available', '1 vehicle available', '2 vehicles available', '3 or more vehicles available', 'Utility gas', 'Bottled, tank, or LP gas', 'Electricity', 'Fuel oil, kerosene, etc.', 'Coal or coke', 'Wood', 'Solar energy', 'Other fuel', 'No fuel used', 'Lacking complete plumbing facilities', 'Lacking complete kitchen facilities', 'No telephone service available', '1.00 or less', '1.01 to 1.50', '1.51 or more')

Empty DataFrame
Columns: []
Index: []

In [33]:
%%bigquery
UPDATE datamart.housing
SET subcategory='moved in year'
WHERE label IN ('Moved in 2017 or later', 'Moved in 2015 to 2016', 'Moved in 2010 to 2014', 'Moved in 2000 to 2009', 'Moved in 1990 to 1999', 'Moved in 1989 and earlier')

Empty DataFrame
Columns: []
Index: []

In [34]:
%%bigquery
UPDATE datamart.housing
SET subcategory='vehicles'
WHERE label IN ('No vehicles available', '1 vehicle available', '2 vehicles available', '3 or more vehicles available')

Empty DataFrame
Columns: []
Index: []

In [35]:
%%bigquery
UPDATE datamart.housing
SET subcategory='house heating fuel'
WHERE label IN ('Utility gas', 'Bottled, tank, or LP gas', 'Electricity', 'Fuel oil, kerosene, etc.', 'Coal or coke', 'Wood', 'Solar energy', 'Other fuel', 'No fuel used')

Empty DataFrame
Columns: []
Index: []

In [36]:
%%bigquery
UPDATE datamart.housing
SET subcategory='selected characteristics'
WHERE label IN ('Lacking complete plumbing facilities', 'Lacking complete kitchen facilities', 'No telephone service available')

Empty DataFrame
Columns: []
Index: []

In [37]:
%%bigquery
UPDATE datamart.housing
SET subcategory='occupants per room'
WHERE label IN ('1.00 or less', '1.01 to 1.50', '1.51 or more')

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery
UPDATE datamart.housing
SET category='owner-occupied units' 
WHERE label IN ('Owner-occupied units', 'Less than $50,000', '$50,000 to $99,999', '$100,000 to $149,999', '$150,000 to $199,999', '$200,000 to $299,999', '$300,000 to $499,999', '$500,000 to $999,999', '$1,000,000 or more', 'Housing units with a mortgage', 'Housing units without a mortgage')
OR (label='Median (dollars)' AND estimate=217500 AND error_margin=180)

Empty DataFrame
Columns: []
Index: []

In [39]:
%%bigquery
UPDATE datamart.housing
SET subcategory='value'
WHERE label IN ('Less than $50,000', '$50,000 to $99,999', '$100,000 to $149,999', '$150,000 to $199,999', '$200,000 to $299,999', '$300,000 to $499,999', '$500,000 to $999,999', '$1,000,000 or more')
OR (label='Median (dollars)' AND estimate=217500 AND error_margin=180)

Empty DataFrame
Columns: []
Index: []

In [40]:
%%bigquery
UPDATE datamart.housing
SET subcategory='mortgage status'
WHERE label IN ('Housing units with a mortgage', 'Housing units without a mortgage')

Empty DataFrame
Columns: []
Index: []

In [13]:
%%bigquery
UPDATE datamart.housing
SET category='housing units with mortgage'
WHERE (label='Less than $500' AND estimate=569949 AND error_margin=6363 AND percent=1.2)
OR (label='$500 to $999' AND estimate=8242060 AND error_margin=44702 AND percent=17)
OR (label='$1,000 to $1,499' AND estimate=13248839 AND error_margin=67426 AND percent=27.4)
OR (label='$1,500 to $1,999' AND estimate=10169830 AND error_margin=54768 AND percent=21)
OR (label='$2,000 to $2,499' AND estimate=6274095 AND error_margin=36485 AND percent=13)
OR (label='$2,500 to $2,999' AND estimate=3841335 AND error_margin=23746 AND percent=7.9)
OR (label='$3,000 or more' AND estimate=6070519 AND error_margin=31722 AND percent=12.5)
OR (label='Median (dollars)' AND estimate=1595 AND error_margin=2)
OR (label='Less than 20.0 percent')
OR (label='20.0 to 24.9 percent' AND estimate=7584745 AND error_margin=48798 AND percent=15.7)
OR (label='25.0 to 29.9 percent' AND estimate=5072173 AND error_margin=29346 AND percent=10.5)
OR (label='30.0 to 34.9 percent' AND estimate=3330974 AND error_margin=18266 AND percent=6.9)
OR (label='35.0 percent or more' AND estimate=10069038 AND error_margin=23122 AND percent=20.9)
OR (label='Not computed' AND estimate=233653 AND error_margin=3535)
OR (label='Housing units with a mortgage')
OR (label='Housing units with a mortgage (excluding units where SMOCAPI cannot be computed)')

Empty DataFrame
Columns: []
Index: []

In [42]:
%%bigquery
UPDATE datamart.housing
SET subcategory='selected monthly owner costs'
WHERE (label='Less than $500' AND estimate=569949 AND error_margin=6363 AND percent=1.2)
OR (label='$500 to $999' AND estimate=8242060 AND error_margin=44702 AND percent=17)
OR (label='$1,000 to $1,499' AND estimate=13248839 AND error_margin=67426 AND percent=27.4)
OR (label='$1,500 to $1,999' AND estimate=10169830 AND error_margin=54768 AND percent=21)
OR (label='$2,000 to $2,499' AND estimate=6274095 AND error_margin=36485 AND percent=13)
OR (label='$2,500 to $2,999' AND estimate=3841335 AND error_margin=23746 AND percent=7.9)
OR (label='$3,000 or more' AND estimate=6070519 AND error_margin=31722 AND percent=12.5)
OR (label='Median (dollars)' AND estimate=1595 AND error_margin=2)

Empty DataFrame
Columns: []
Index: []

In [43]:
%%bigquery
UPDATE datamart.housing
SET subcategory='selected monthly owner costs as a percentage of household income'
WHERE (label='Less than 20.0 percent')
OR (label='20.0 to 24.9 percent' AND estimate=7584745 AND error_margin=48798 AND percent=15.7)
OR (label='25.0 to 29.9 percent' AND estimate=5072173 AND error_margin=29346 AND percent=10.5)
OR (label='30.0 to 34.9 percent' AND estimate=3330974 AND error_margin=18266 AND percent=6.9)
OR (label='35.0 percent or more' AND estimate=10069038 AND error_margin=23122 AND percent=20.9)
OR (label='Not computed' AND estimate=233653 AND error_margin=3535)

Empty DataFrame
Columns: []
Index: []

In [11]:
%%bigquery
UPDATE datamart.housing
SET category='housing units without mortgage'
WHERE label IN ('Less than $250', '$250 to $399', '$400 to $599', '$600 to $799', '$800 to $999', '$1,000 or more', 'Less than 10.0 percent', '10.0 to 14.9 percent')
OR (label='Median (dollars)' AND estimate=500 AND error_margin=1)
OR (label='15.0 to 19.9 percent' AND estimate=3154745 AND error_margin=16364 AND percent=11.1)
OR (label='20.0 to 24.9 percent' AND estimate=1916515 AND error_margin=11272 AND percent=6.7)
OR (label='25.0 to 29.9 percent' AND estimate=1235715 AND error_margin=7526 AND percent=4.3)
OR (label='30.0 to 34.9 percent' AND estimate=836924 AND error_margin=6646 AND percent=2.9)
OR (label='35.0 percent or more' AND estimate=3010014 AND error_margin=15340 AND percent=10.6)
OR (label='Not computed' AND estimate=394725 AND error_margin=4268)
OR (label='Housing units without a mortgage')
OR (label='Housing unit without a mortgage (excluding units where SMOCAPI cannot be computed)')

Empty DataFrame
Columns: []
Index: []

In [45]:
%%bigquery
UPDATE datamart.housing
SET subcategory='selected monthly owner costs'
WHERE label IN ('Less than $250', '$250 to $399', '$400 to $599', '$600 to $799', '$800 to $999', '$1,000 or more')
OR (label='Median (dollars)' AND estimate=500 AND error_margin=1)

Empty DataFrame
Columns: []
Index: []

In [46]:
%%bigquery
UPDATE datamart.housing
SET subcategory='selected monthly owner costs as a percentage of household income'
WHERE label IN ('Less than 10.0 percent', '10.0 to 14.9 percent')
OR (label='15.0 to 19.9 percent' AND estimate=3154745 AND error_margin=16364 AND percent=11.1)
OR (label='20.0 to 24.9 percent' AND estimate=1916515 AND error_margin=11272 AND percent=6.7)
OR (label='25.0 to 29.9 percent' AND estimate=1235715 AND error_margin=7526 AND percent=4.3)
OR (label='30.0 to 34.9 percent' AND estimate=836924 AND error_margin=6646 AND percent=2.9)
OR (label='35.0 percent or more' AND estimate=3010014 AND error_margin=15340 AND percent=10.6)
OR (label='Not computed' AND estimate=394725 AND error_margin=4268)

Empty DataFrame
Columns: []
Index: []

In [14]:
%%bigquery
UPDATE datamart.housing
SET category='occupied units paying rent'
WHERE (label='Less than $500' AND estimate=3865037 AND error_margin=13581 AND percent=9.4)
OR (label='$500 to $999' AND estimate=14956085 AND error_margin=47591 AND percent=36.2)
OR (label='$1,000 to $1,499' AND estimate=12403502 AND error_margin=50982 AND percent=30)
OR (label='$1,500 to $1,999' AND estimate=5796670 AND error_margin=32779 AND percent=14)
OR (label='$2,000 to $2,499' AND estimate=2324841 AND error_margin=14722 AND percent=5.6)
OR (label='$2,500 to $2,999' AND estimate=987766 AND error_margin=8283 AND percent=2.4)
OR (label='$3,000 or more' AND estimate=977971 AND error_margin=7308 AND percent=2.4)
OR (label='Median (dollars)' AND estimate=1062 AND error_margin=1)
OR (label='No rent paid' AND estimate=2169795 AND error_margin=10848)
OR (label='Less than 15.0 percent')
OR (label='15.0 to 19.9 percent' AND estimate=5195435 AND error_margin=23159 AND percent=12.9)
OR (label='20.0 to 24.9 percent' AND estimate=5190296 AND error_margin=21539 AND percent=12.9)
OR (label='25.0 to 29.9 percent' AND estimate=4681621 AND error_margin=19362 AND percent=11.6)
OR (label='30.0 to 34.9 percent' AND estimate=3674673 AND error_margin=17612 AND percent=9.1)
OR (label='35.0 percent or more' AND estimate=16328272 AND error_margin=67971 AND percent=40.5)
OR (label='Not computed' AND estimate=3115329 AND error_margin=16031)
OR (label='Occupied units paying rent')
OR (label='Occupied units paying rent (excluding units where GRAPI cannot be computed)')

Empty DataFrame
Columns: []
Index: []

In [48]:
%%bigquery
UPDATE datamart.housing
SET subcategory='gross rent'
WHERE (label='Less than $500' AND estimate=3865037 AND error_margin=13581 AND percent=9.4)
OR (label='$500 to $999' AND estimate=14956085 AND error_margin=47591 AND percent=36.2)
OR (label='$1,000 to $1,499' AND estimate=12403502 AND error_margin=50982 AND percent=30)
OR (label='$1,500 to $1,999' AND estimate=5796670 AND error_margin=32779 AND percent=14)
OR (label='$2,000 to $2,499' AND estimate=2324841 AND error_margin=14722 AND percent=5.6)
OR (label='$2,500 to $2,999' AND estimate=987766 AND error_margin=8283 AND percent=2.4)
OR (label='$3,000 or more' AND estimate=977971 AND error_margin=7308 AND percent=2.4)
OR (label='Median (dollars)' AND estimate=1062 AND error_margin=1)
OR (label='No rent paid' AND estimate=2169795 AND error_margin=10848)

Empty DataFrame
Columns: []
Index: []

In [49]:
%%bigquery
UPDATE datamart.housing
SET subcategory='gross rent as a percentage of household income'
WHERE (label='Less than 15.0 percent')
OR (label='15.0 to 19.9 percent' AND estimate=5195435 AND error_margin=23159 AND percent=12.9)
OR (label='20.0 to 24.9 percent' AND estimate=5190296 AND error_margin=21539 AND percent=12.9)
OR (label='25.0 to 29.9 percent' AND estimate=4681621 AND error_margin=19362 AND percent=11.6)
OR (label='30.0 to 34.9 percent' AND estimate=3674673 AND error_margin=17612 AND percent=9.1)
OR (label='35.0 percent or more' AND estimate=16328272 AND error_margin=67971 AND percent=40.5)
OR (label='Not computed' AND estimate=3115329 AND error_margin=16031)

Empty DataFrame
Columns: []
Index: []

#### make fields null in percent column if they're not percentages

In [16]:
%%bigquery
UPDATE datamart.housing
SET percent=null
WHERE estimate=percent

Empty DataFrame
Columns: []
Index: []

#### remove duplicate records

In [51]:
%%bigquery
CREATE OR REPLACE TABLE datamart.housing AS
SELECT DISTINCT *
FROM datamart.housing

Empty DataFrame
Columns: []
Index: []

In [105]:
%%bigquery
DELETE FROM datamart.housing
WHERE (label='Occupied housing units' AND percent IS null)
OR (label='Housing units with a mortgage' AND percent IS null)
OR (label='Housing units without a mortgage' AND percent IS null)

Empty DataFrame
Columns: []
Index: []

#### PK check: if same number then no duplicates

In [106]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.housing) AS housing_count
FROM (
    SELECT DISTINCT category, subcategory, label
    FROM datamart.housing
)

   distinct_PK  housing_count
0          130            130

#### FK check

In [107]:
%%bigquery
SELECT count(*) AS foreign_key_violations
FROM datamart.housing AS h
LEFT JOIN datamart.locations AS l ON h.country=l.country
WHERE l.id IS null

   foreign_key_violations
0                       0

### Transforms for table economics

#### Create economics temp

In [1]:
%%bigquery
CREATE OR REPLACE TABLE datamart.economics_temp AS
SELECT 'US' AS country, null AS category, null AS subcategory, TRIM (Label) AS label, CAST(United_States__Estimate AS NUMERIC) AS estimate, REGEXP_REPLACE(United_States__Margin_of_Error, '[^0-9.]', '') AS error_margin, REGEXP_REPLACE(United_States__Percent, '[^0-9.]', '') AS percent, REGEXP_REPLACE(United_States__Percent_Margin_of_Error, '[^0-9.]', '') AS error_margin_percent
FROM us_census_bureau_staging.acs_economics

Empty DataFrame
Columns: []
Index: []

#### Update blank strings to nulls

In [2]:
%%bigquery
UPDATE datamart.economics_temp
SET error_margin=null
WHERE error_margin=''

Empty DataFrame
Columns: []
Index: []

In [3]:
%%bigquery
UPDATE datamart.economics_temp
SET error_margin_percent=null
WHERE error_margin_percent=''

Empty DataFrame
Columns: []
Index: []

In [4]:
%%bigquery
UPDATE datamart.economics_temp
SET percent=null
WHERE percent=''

Empty DataFrame
Columns: []
Index: []

#### Create Table Economics

In [5]:
%%bigquery
CREATE OR REPLACE TABLE datamart.economics AS
SELECT country, CAST(category AS STRING) AS category, CAST(subcategory AS STRING) AS subcategory, label, estimate, CAST(error_margin AS NUMERIC) AS error_margin, CAST(percent AS NUMERIC) AS percent, CAST(error_margin_percent AS NUMERIC) AS error_margin_percent
FROM datamart.economics_temp

Empty DataFrame
Columns: []
Index: []

#### Remove non-data rows

In [6]:
%%bigquery
DELETE FROM datamart.economics
WHERE estimate IS null AND error_margin IS null AND percent IS null AND error_margin IS null

Empty DataFrame
Columns: []
Index: []

#### Update records with corresponding category and subcategory

In [107]:
%%bigquery 
UPDATE datamart.economics
SET category = 'employment'
WHERE label IN ('Civilian employed population 16 years and over', 'In labor force', 'Civilian labor force', 'Armed Forces', 'Not in labor force', 'Civilian labor force', 'Unemployment Rate', 'All parents in family in labor force', 'Car, truck, or van -- drove alone', 'Car, truck, or van -- carpooled', 'Public transportation (excluding taxicab)', 'Walked', 'Other means', 'Worked from home', 'Mean travel time to work (minutes)', 'Agriculture, forestry, fishing and hunting, and mining', 'Construction', 'Manufacturing', 'Wholesale trade', 'Retail trade', 'Transportation and warehousing, and utilities', 'Information', 'Finance and insurance, and real estate and rental and leasing', 'Professional, scientific, and management, and administrative and waste management services', 'Educational services, and health care and social assistance', 'Arts, entertainment, and recreation, and accommodation and food services', 'Other services, except public administration', 'Public administration', 'Private wage and salary workers', 'Government workers', 'Self-employed in own not incorporated business workers', 'Unpaid family workers', 'Less than $10,000', '$10,000 to $14,999', '$15,000 to $24,999', '$25,000 to $34,999', '$35,000 to $49,999' , '$50,000 to $74,999', '$75,000 to $99,999', '$100,000 to $149,999', '$150,000 to $199,999', '$200,000 or more', 'Median household income (dollars)', 'Mean household income (dollars)', 'With earnings', 'Mean earnings (dollars)', 'With Social Security', 'Mean Social Security income (dollars)', 'With retirement income','Mean retirement income (dollars)', 'With Supplemental Security income (dollars)', 'Mean Supplemental Security Income (dollars)', 'With cash public assistance income', 'Mean cash public assistance income (dollars)', 'With Food Stamp/SNAP benefits in the past 12 months', 'Nonfamily households', 'Median nonfamily income (dollars)', 'Mean nonfamily income (dollars)', 'Median earnings for workers (dollars)', 'Median earnings for male full-time, year-round workers (dollars)', 'Median earnings for female full-time, year-round workers (dollars)', 'Employed:', "Unemployed:", "Workers 16 years and over", 'Mean family income (dollars)', 'Median family income (dollars)', 'Per capita income (dollars)')

Empty DataFrame
Columns: []
Index: []

In [132]:
%%bigquery 
UPDATE datamart.economics
SET category = 'general'
WHERE label IN ('All people','Families', 'All families', '18 to 64 years', 'Married couple families', 'People in families', '18 years and over', '65 years and over' ,'Population 16 years and over', 'Total households', 'Females 16 years and over','Own children of the householder under 6 years', 'Own children of the householder 6 to 17 years', 'Management, business, science, and arts occupations', 'Service occupations', 'Sales and office occupations', 'Natural resources, construction, and maintenance occupations', 'Production, transportation, and material moving occupations', 'With related children of the householder under 5 years only', 'Related children of the householder under 5 years', 'With related children of the householder under 18 years', 'Related children of the householder 5 to 17 years', 'Under 18 years', 'Families with female householder, no spouse present', 'Unrelated individuals 15 years and over','Related children of the householder under 18 years', "With Supplemental Security Income")

Empty DataFrame
Columns: []
Index: []

In [16]:
%%bigquery 
UPDATE datamart.economics
SET subcategory = 'employment status'
WHERE (label = 'Population 16 years and over')
OR (label = 'Workers 16 years and over')
OR (label ='Total households')
OR (label ='Civilian employed population 16 years and over')
OR (label = 'In labor force:')
OR (label = 'Armed Forces')
OR (label = 'Not in labor force:')
OR (label = 'Civilian labor force' AND estimate = 163555585 AND percent = .63)
OR (label = 'Unemployment Rate')
OR (label = 'Unemployed:')
OR (label = 'Employed:')

Empty DataFrame
Columns: []
Index: []

In [17]:
%%bigquery 
UPDATE datamart.economics
SET subcategory = 'females 16 years and over'
WHERE (label ='Females 16 years and over')
OR (label = 'Civilian labor force' AND estimate = 77596212)
OR (label = 'Employed' AND estimate = 73536561)
OR (label = 'In labor force' AND estimate = 77750312)

Empty DataFrame
Columns: []
Index: []

In [18]:
%%bigquery 
UPDATE datamart.economics
SET subcategory = 'children of the householder'
WHERE label in ('Own children of the householder under 6 years')
OR (label = 'Own children of the householder 6 to 17 years')

Empty DataFrame
Columns: []
Index: []

In [19]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'commuting to work'
WHERE label in ('Car, truck, or van -- drove alone', 'Car, truck, or van -- carpooled', 'Public transportation (excluding taxicab)', 'Walked', 'Other means', 'Worked from home', 'Mean travel time to work (minutes)')

Empty DataFrame
Columns: []
Index: []

In [113]:
%%bigquery
UPDATE datamart.economics 
SET subcategory = 'occupation'
WHERE label in ('Management, business, science, and arts occupations', 'Service occupations', 'Sales and office occupations', 'Natural resources, construction, and maintenance occupations', 'Production, transportation, and material moving occupations')

Empty DataFrame
Columns: []
Index: []

In [114]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'industry'
WHERE label in ('Agriculture, forestry, fishing and hunting, and mining', 'Construction', 'Manufacturing', 'Wholesale trade', 'Retail trade', 'Transportation and warehousing, and utilities', 'Information', 'Finance and insurance, and real estate and rental and leasing', 'Professional, scientific, and management, and administrative and waste management services', 'Educational services, and health care and social assistance', 'Arts, entertainment, and recreation, and accommodation and food services', 'Other services, except public administration', 'Public administration')

Empty DataFrame
Columns: []
Index: []

In [115]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'class of worker'
WHERE label in ('Private wage and salary workers', 'Government workers', 'Self-employed in own not incorporated business workers', 'Unpaid family workers')

Empty DataFrame
Columns: []
Index: []

In [116]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'income'
WHERE (label = 'Less than $10,000' AND estimate = 7302871)
OR (label = '$10,000 to $14,999' AND estimate = 5189583)
OR (label = '$15,000 to $24,999' AND estimate = 10760144)
OR (label = '$25,000 to $34,999' AND estimate = 10792134)
OR (label = '$35,000 to $49,999' AND estimate = 14822045)
OR (label = '$50,000 to $74,999' AND estimate = 20789890)
OR (label = '$75,000 to $99,999' AND estimate = 15374617)
OR (label = '$100,000 to $149,999' AND estimate = 18286811)
OR (label = '$150,000 to $199,999' AND estimate = 8173563)
OR (label = '$200,000 or more' AND estimate = 9264390)

Empty DataFrame
Columns: []
Index: []

In [117]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'benefits'
WHERE label in ('Median household income (dollars)', 'Mean household income (dollars)', 'With earnings', 'Mean earnings (dollars)', 'With Social Security', 'Mean Social Security income (dollars)', 'With retirement income','Mean retirement income (dollars)', 'With Supplemental Security Income', 'Mean Supplemental Security Income (dollars)', 'With cash public assistance income', 'Mean cash public assistance income (dollars)', 'With Food Stamp/SNAP benefits in the past 12 months')

Empty DataFrame
Columns: []
Index: []

In [118]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'families income'
WHERE (label ='Less than $10,000' AND estimate = 2905334)
OR (label = '$10,000 to $14,999' AND estimate = 1835765)
OR (label = '$15,000 to $24,999' AND estimate = 4904304)
OR (label = '$25,000 to $34,999' AND estimate = 5896133)
OR (label = '$35,000 to $49,999' AND estimate = 8950976)
OR (label = '$50,000 to $74,999' AND estimate = 13867897)
OR (label = '$75,000 to $99,999' AND estimate = 11374396)
OR (label = '$100,000 to $149,999' AND estimate = 14620038)
OR (label = '$150,000 to $199,999' AND estimate = 6852461)
OR (label = '$200,000 or more' AND estimate = 7906727)
OR (label = 'Median family income (dollars)')
OR (label = 'Mean family income (dollars)')
OR (label = 'Per capita income (dollars)')
OR (label = 'Families')

Empty DataFrame
Columns: []
Index: []

In [119]:
%%bigquery
UPDATE datamart.economics
SET subcategory = 'nonfamily households'
WHERE label in ('Nonfamily households', 'Median nonfamily income (dollars)', 'Mean nonfamily income (dollars)', 'Median earnings for workers (dollars)', 'Median earnings for male full-time, year-round workers (dollars)', 'Median earnings for female full-time, year-round workers (dollars)')

Empty DataFrame
Columns: []
Index: []

In [120]:
%%bigquery
UPDATE datamart.economics
SET category = 'Health Insurance Coverage'
WHERE (label = 'Civilian noninstitutionalized population', 'With health insurance coverage', 'With private health insurance', 'With public coverage', 'No health insurance coverage', 'Civilian noninstitutionalized population under 19 years', 'Civilian noninstitutionalized population 19 to 64 years', "Employed:", 'Unemployed:', 'In labor force:', 'Not in labor force:')

Empty DataFrame
Columns: []
Index: []

In [8]:
%%bigquery 
UPDATE datamart.economics 
SET subcategory = 'Civilian noninstutionalized population'
WHERE (label= 'Civilian noninstitutionalized population')
OR (label = 'With health insurance coverage' AND estimate = 291458259)
OR (label = 'With private health insurance' AND estimate = 217186300)
OR (label = 'With public coverage' AND estimate = 112236495)
OR (label = 'No health insurance coverage' AND estimate = 29249613)

Empty DataFrame
Columns: []
Index: []

In [122]:
%%bigquery 
UPDATE datamart.economics 
SET subcategory = 'Civilian noninstutionalized population under 19 years'
WHERE (label = 'No health insurance coverage' AND estimate = 3945906)

Empty DataFrame
Columns: []
Index: []

In [123]:
%%bigquery 
UPDATE datamart.economics 
SET subcategory = 'Civilian noninstutionalized population 19 to 64 years'
WHERE (label= 'In labor force:')
OR (label = 'Employed:')
OR (label = 'Unemployed:')
OR (label = 'Not in labor force:')

Empty DataFrame
Columns: []
Index: []

In [13]:
%%bigquery
DELETE FROM datamart.economics
WHERE (label='With health insurance coverage' AND estimate != 291458259)
OR (label='With private health insurance' AND estimate != 217186300)
OR (label='With public coverage' AND estimate != 112236495)
OR (label='No health insurance coverage' AND (estimate != 29249613 AND estimate != 3945906))
OR (label = 'All parents in family in labor force')

Empty DataFrame
Columns: []
Index: []

In [10]:
%%bigquery 
UPDATE datamart.economics
SET subcategory = 'percent below poverty level'
WHERE label in ('All families', 'Married couple families', 'Families with female householder, no spouse present', 'All people', 'Under 18 years', '18 years and over', '18 to 64 years', '65 years and over', 'People in families', 'Unrelated individuals 15 years and over')

Empty DataFrame
Columns: []
Index: []

In [11]:
%%bigquery 
DELETE FROM datamart.economics 
WHERE (label ='With related children of the householder under 18 years')
OR (label = 'With related children of the householder under 5 years only')
OR (label = 'Related children of the householder 5 to 17 years')
OR (label = 'Civilian labor force' AND percent = 163555585)

Empty DataFrame
Columns: []
Index: []

In [32]:

%%bigquery
DELETE FROM datamart.economics
WHERE (subcategory='employment status' AND label='Civilian labor force' AND percent IS null)

Empty DataFrame
Columns: []
Index: []

#### Make fields null in percent column if they are not percentages

In [127]:
%%bigquery
UPDATE datamart.economics
SET percent=null
WHERE estimate=percent

Empty DataFrame
Columns: []
Index: []

#### Remove Duplicate Records

In [128]:
%%bigquery
CREATE OR REPLACE TABLE datamart.economics AS
SELECT DISTINCT *
FROM datamart.economics

Empty DataFrame
Columns: []
Index: []

#### Primary Key Check: If they are the same number then there are no duplicates

In [33]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.economics) AS economics_count
FROM (
    SELECT DISTINCT category, subcategory, label
    FROM datamart.economics
)

   distinct_PK  economics_count
0          112              112

#### Foreign Key check

In [31]:
%%bigquery
SELECT count(*) AS foreign_key_violations
FROM datamart.economics AS h
LEFT JOIN datamart.locations AS l ON h.country=l.country
WHERE l.id IS null

   foreign_key_violations
0                       0

### Transforms for table social

#### Create social temp

In [7]:
%%bigquery
CREATE OR REPLACE TABLE datamart.social_temp AS
SELECT 'US' AS country, null AS category, null AS subcategory, TRIM(_Label_) AS label, CAST(United_States__Estimate AS NUMERIC) AS estimate, REGEXP_REPLACE(United_States__Margin_of_Error, '[^0-9.]', '') AS error_margin, REGEXP_REPLACE(United_States__Percent, '[^0-9.]', '') AS percent, REGEXP_REPLACE(United_States__Percent_Margin_of_Error, '[^0-9.]', '') AS error_margin_percent
FROM us_census_bureau_staging.acs_social

Empty DataFrame
Columns: []
Index: []

#### Update Blank Strings to nulls

In [8]:
%%bigquery
UPDATE datamart.social_temp
SET error_margin=null
WHERE error_margin=''

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery
UPDATE datamart.social_temp
SET error_margin_percent=null
WHERE error_margin_percent=''

Empty DataFrame
Columns: []
Index: []

In [10]:
%%bigquery
UPDATE datamart.social_temp
SET percent=null
WHERE percent=''

Empty DataFrame
Columns: []
Index: []

#### Create Table Social

In [11]:
%%bigquery
CREATE OR REPLACE TABLE datamart.social AS
SELECT country, CAST(category AS STRING) AS category, CAST(subcategory AS STRING) AS subcategory, label, estimate, CAST(error_margin AS NUMERIC) AS error_margin, CAST(percent AS NUMERIC) AS percent, CAST(error_margin_percent AS NUMERIC) AS error_margin_percent 
FROM datamart.social_temp

Empty DataFrame
Columns: []
Index: []

#### Remove non data rows

In [12]:
%%bigquery
DELETE FROM datamart.social
WHERE estimate IS null AND error_margin IS null AND percent IS null AND error_margin IS null

Empty DataFrame
Columns: []
Index: []

##### Update records with corresponding category and sub category

In [43]:
%%bigquery 
UPDATE datamart.social
SET category = 'relationships'
WHERE label IN ('Population in households', 'Householder', 'Spouse', 'Unmarried partner', 'Child', 'Other relatives', 'Other nonrelatives','Never married', 'Males 15 years and over', 'Now married, except separated', 'Separated', 'Widowed','Divorced', 'Females 15 years and over', 'Number of women 15 to 50 years old who had a birth in the past 12 months', 'Unmarried women (widowed, divorced, and never married)', 'Per 1,000 unmarried women', 'Per 1,000 women 15 to 50 years old', 'Per 1,000 women 15 to 19 years old', 'Per 1,000 women 20 to 34 years old', 'Per 1,000 women 35 to 50 years old', 'Number of grandparents living with own grandchildren under 18 years', 'Grandparents responsible for grandchildren',  'Less than 1 year', '1 or 2 years', '3 or 4 years', '5 or more years', 'Number of grandparents responsible for own grandchildren under 18 years')

Empty DataFrame
Columns: []
Index: []

In [10]:
%%bigquery
UPDATE datamart.social
SET category = 'general'
WHERE label IN ('Population 3 years and over enrolled in school', 'Nursery school,preschool', 'Kindergarten', 'Elementary school (grades 1-8)', 'High school (grades 9-12)', 'College or graduate school', 'Population 25 years and over', 'Less than 9th grade', '9th to 12th grade, no diploma', 'High school graduate (includes equivalency)', 'Some college, no degree', "Associate's degree", "Bachelor's degree", 'Graduate or professional degree', 'High school graduate or higher', "Bachelor's degree or higher", 'Civilian population 18 years and over', 'Civilian veterans', 'Total Civilian Noninstitutionalized Population', 'Under 18 years', '18 to 64 years', '65 years and over', 'With a computer', 'With a broadband Internet subscription')

Empty DataFrame
Columns: []
Index: []

In [58]:
%%bigquery 
UPDATE datamart.social
SET category = 'residence'
WHERE label IN ('Total households', 'Married-couple family', 'Population 1 year and over', 'Cohabiting couple household', 'Male householder, no spouse/partner present', 'Female householder, no spouse/partner present','Households with one or more people under 18 years','Households with one or more people 65 years and over', 'Average household size','Average family size', 'Same house', 'Different house in the U.S.', 'Same county', 'Different county', 'Same state', 'Different state', 'Abroad', 'Total population', 'Born in the  United States', "State of residence",'residence 1 year ago', 'Born in Puerto Rico, U.S. Island areas, or born abroad to American parent(s)', 'Foreign born')

Empty DataFrame
Columns: []
Index: []

In [11]:
%%bigquery 
UPDATE datamart.social
SET category = 'culture and ancestry'
WHERE label IN ('Foreign-born population', 'Population born outside the United States', 'Population 5 years and over', 'Naturalized U.S. citizen', 'Not a U.S. citizen', 'Peopleborn outside the United States', 'Native', 'Foreign born', 'Foreign-born population, excluding population born at sea', 'Europe', 'Asia', 'Africa', 'Oceania', 'Latin America', 'Northern America', 'English only', 'Language other than English', "Spanish", 'Other Indo-European languages', 'Asian and Pacific Islander languages', 'Other languages', 'Total population', 'American', 'Arab', 'Czech', 'Danish', 'Dutch', 'English', 'French (except Basque)', 'French Canadian', 'German', 'Greek', 'Hungarian', 'Irish', 'Italian', 'Lithuanian', 'Norwegian', 'Polish', 'Portuguese', 'Russian', 'Scotch-Irish', 'Scottish', 'Slovak', 'Subsaharan African', 'Swedish', 'Swiss', 'Ukrainian', 'Welsh', 'West Indian (excluding Hispanic origin groups)' )

Empty DataFrame
Columns: []
Index: []

In [57]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'household types'
WHERE (label = 'Total households')
OR (label = 'Married-couple family')
OR (label = 'Cohabiting couple household')
OR (label = 'Male householder, no spouse/partner present')
OR (label = 'Female householder, no spouse/partner present')
OR (label = 'Households with one or more people under 18 years')
OR (label = 'Households with one or more people 65 years and over')
OR (label = 'Average household size')
OR (label = 'Average family size')

Empty DataFrame
Columns: []
Index: []

In [3]:
%%bigquery 
DELETE from datamart.social 
WHERE (label = 'With own children of the householder under 18 years')
OR (label = 'Householder living alone')
OR (label = 'Entered 2010 or later')
OR (label = 'Entered before 2010')
OR (label = '65 years and over' AND estimate = 4227728)
OR (label = '65 years and over' AND estimate = 9032038)

Empty DataFrame
Columns: []
Index: []

In [11]:
%%bigquery 
UPDATE datamart.social 
SET subcategory = 'relationships in household'
WHERE label in ('Population in households', 'Householder', 'Spouse', 'Unmarried partner', 'Child', 'Other relatives', 'Other nonrelatives')

Empty DataFrame
Columns: []
Index: []

In [12]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'males marital status'
WHERE (label = 'Never married' and estimate = 47039874)
OR (label = 'Males 15 years and over')
OR (label = 'Now married, except separated' and estimate = 64014364)
OR (label = 'Separated' and estimate = 2094580)
OR (label = 'Widowed' and estimate = 3396202)
OR (label = 'Divorced' and estimate = 12244434)

Empty DataFrame
Columns: []
Index: []

In [13]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'females marital status'
WHERE (label = 'Never married' and estimate = 41019187)
OR (label = 'Females 15 years and over')
OR (label = 'Now married, except separated' and estimate = 62809181)
OR (label = 'Separated' and estimate = 2950832)
OR (label = 'Widowed' and estimate = 11878769)
OR (label = 'Divorced' and estimate = 16397947)

Empty DataFrame
Columns: []
Index: []

In [41]:
%%bigquery
UPDATE datamart.social 
SET subcategory = 'fertility'
WHERE label in ('Number of women 15 to 50 years old who had a birth in the past 12 months', 'Unmarried women (widowed, divorced, and never married)', 'Per 1,000 unmarried women', 'Per 1,000 women 15 to 50 years old', 'Per 1,000 women 15 to 19 years old', 'Per 1,000 women 20 to 34 years old', 'Per 1,000 women 35 to 50 years old')

Empty DataFrame
Columns: []
Index: []

In [42]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'grandparents'
WHERE label in ('Number of grandparents living with own grandchildren under 18 years', 'Grandparents responsible for grandchildren',  'Less than 1 year', '1 or 2 years', '3 or 4 years', '5 or more years', 'Number of grandparents responsible for own grandchildren under 18 years')

Empty DataFrame
Columns: []
Index: []

In [20]:
%%bigquery 
DELETE from datamart.social 
WHERE label in ('Who are female', 'Who are married', 'With a disability', 'Speak English less than "very well"')

Empty DataFrame
Columns: []
Index: []

In [17]:
%%bigquery 
UPDATE datamart.social 
SET subcategory = 'School Enrollment'
WHERE label in ('Population 3 years and over enrolled in school', 'Nursery school, preschool', 'Kindergarten', 'Elementary school (grades 1-8)', 'High school (grades 9-12)', 'College or graduate school')

Empty DataFrame
Columns: []
Index: []

In [18]:
%%bigquery
UPDATE datamart.social
SET subcategory = 'Educational Attainment'
WHERE label in ('Population 25 years and over', 'Less than 9th grade', '9th to 12th grade, no diploma', 'High school graduate (includes equivalency)', 'Some college, no degree', "Associate's degree", "Bachelor's degree", 'Graduate or professional degree', 'High school graduate or higher', "Bachelor's degree or higher")

Empty DataFrame
Columns: []
Index: []

In [38]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'Veteran Status'
WHERE label in ('Civilian population 18 years and over', 'Civilian veterans', 'Total Civilian Noninstitutionalized Population', 'Under 18 years', '18 to 64 years', '65 years and over')

Empty DataFrame
Columns: []
Index: []

In [21]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'residence 1 year ago'
WHERE (label = 'Population 1 year and over')
OR (label = 'Same house')
OR (label = 'Different house in the U.S.')
OR (label = 'Same county')
OR (label ='Different county')
OR (label = 'Same state')
OR (label = 'Different state' AND estimate = 7475038)
OR (label = 'Abroad')

Empty DataFrame
Columns: []
Index: []

In [13]:
%%bigquery
UPDATE datamart.social
SET subcategory = 'U.S. citizenship status'
WHERE (label = 'Total population')
OR (label = 'Native' AND estimate = 280685925) 
OR (label ='Born in United States')
OR (label = 'State of residence')
OR (label = 'Different state' AND estimate = 86504176)
OR (label = 'Born in Puerto Rico, U.S. Island areas, or born abroad to American parent(s)')
OR (label = 'Foreign born' AND estimate = 44011870)
OR (label = 'Foreign-born population')
OR (label = 'Naturalized U.S. citizen')
OR (label = 'Not a U.S. citizen ')

Empty DataFrame
Columns: []
Index: []

In [1]:
%%bigquery
UPDATE datamart.social
SET subcategory = 'year of entry'
WHERE (label = 'Population born outside the United States')
OR (label = 'Native' AND estimate = 5148655)
OR (label = 'Foreign born' AND estimate = 44011870 AND percent = 13.6)

Empty DataFrame
Columns: []
Index: []

In [24]:
%%bigquery 
UPDATE datamart.social 
SET subcategory = 'region of birth of foreign born'
WHERE label in ('Foreign-born population, excluding population born at sea', 'Europe', 'Asia', 'Africa', 'Oceania', 'Latin America', 'Northern America')

Empty DataFrame
Columns: []
Index: []

In [8]:
%%bigquery 
UPDATE datamart.social 
SET subcategory = 'language spoken at home'
WHERE label in ('Population 5 years and over', 'English only', 'Language other than English', 'Spanish', 'Other Indo-European languages', 'Asian and Pacific Islander languages', 'Other languages')

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'ancestry'
WHERE label in ('Total population', 'American', 'Arab', 'Czech', 'Danish', 'Dutch', 'English', 'French (except Basque)', 'French Canadian', 'German', 'Greek', 'Hungarian', 'Irish', 'Italian', 'Lithuanian', 'Norwegian', 'Polish', 'Portuguese', 'Russian', 'Scotch-Irish', 'Scottish', 'Slovak', 'Subsaharan African', 'Swedish', 'Swiss', 'Ukrainian', 'Welsh', 'West Indian (excluding Hispanic origin groups)')

Empty DataFrame
Columns: []
Index: []

In [54]:
%%bigquery 
UPDATE datamart.social
SET subcategory = 'computer and internet use'
WHERE label in ('With a computer', 'With a broadband Internet subscription')

Empty DataFrame
Columns: []
Index: []

#### Make fields null in pecent col if they are not percentages

In [33]:
%%bigquery
UPDATE datamart.social
SET percent=null
WHERE estimate=percent

Empty DataFrame
Columns: []
Index: []

In [34]:
%%bigquery
CREATE OR REPLACE TABLE datamart.social AS
SELECT DISTINCT *
FROM datamart.social

Empty DataFrame
Columns: []
Index: []

#### Check Primary Keys

In [4]:
%%bigquery
SELECT count(*) AS distinct_PK, (SELECT count(*) FROM datamart.social) AS social_count
FROM (
    SELECT DISTINCT category, subcategory, label
    FROM datamart.social
)

   distinct_PK  social_count
0          128           128

#### Check FK violations

In [7]:
%%bigquery
SELECT count(*) AS foreign_key_violations
FROM datamart.social AS h
LEFT JOIN datamart.locations AS l ON h.country=l.country
WHERE l.id IS null

   foreign_key_violations
0                       0

### SQL Queries

#### Get the estimated population of Americans affected by COVID-19 based on the average US April 14, 2021 incident rate, and display the estimated population distributed by the percentage of household income allocated to gross rent (assuming every American household occupies a housing unit for rent)

In [13]:
%%bigquery
SELECT label AS Percentage_of_Household_Income_for_Gross_Rent, (h.percent/100)*
                                (((SELECT AVG(incident_rate)
                                    FROM datamart.cases 
                                    WHERE last_update=(SELECT MAX(last_update) 
                                                        FROM datamart.cases AS c 
                                                        JOIN datamart.locations AS l ON c.location_id=l.id 
                                                        WHERE l.country='US' AND last_update between '2021-04-14' and '2021-04-14 23:59:59'))/100000)
                                *
                                (SELECT estimate FROM datamart.demographics WHERE label='Total population')) AS Estimated_COVID_Affected_Population 
FROM datamart.housing AS h
WHERE subcategory='gross rent as a percentage of household income' AND percent IS NOT null
ORDER BY Percentage_of_Household_Income_for_Gross_Rent

,Percentage_of_Household_Income_for_Gross_Rent,Estimated_COVID_Affected_Population
0,15.0 to 19.9 percent,3.520428e+06
1,20.0 to 24.9 percent,3.520428e+06
2,25.0 to 29.9 percent,3.165657e+06
3,30.0 to 34.9 percent,2.483403e+06
4,35.0 percent or more,1.105251e+07
5,Less than 15.0 percent,3.575009e+06

#### Get the projected number of COVID-19 deaths in the US based on the US's average April 14, 2021 (our most recent data entry) case fatality ratio , and display the estimated deaths distributed by race (assuming that the projected number of deaths is accurately split by the race percentages reported in demographics [focused on the subcategories with one race/two or more races]; the same day's average incident rate is used to project the number of people affected by COVID-19)

In [8]:
%%bigquery
SELECT label AS Race, (d.percent/100)*(
                                        ((SELECT AVG(case_fatality_ratio)
                                        FROM datamart.cases
                                        WHERE last_update=(
                                        SELECT MAX(last_update)
                                        FROM datamart.cases AS c 
                                        JOIN datamart.locations AS l ON c.location_id=l.id 
                                        WHERE l.country='US' AND last_update between '2021-04-14' and '2021-04-14 23:59:59'))/100)
                                        *
                                        (((SELECT AVG(incident_rate) 
                                        FROM datamart.cases
                                        WHERE last_update=(
                                        SELECT MAX(last_update)
                                        FROM datamart.cases AS c 
                                        JOIN datamart.locations AS l ON c.location_id=l.id 
                                        WHERE l.country='US' AND last_update between '2021-04-14' and '2021-04-14 23:59:59'))/100000)*(SELECT estimate FROM datamart.demographics WHERE label='Total population'))
                                        ) AS Projected_Deaths
FROM datamart.demographics AS d
WHERE (subcategory1='one race' AND label IN ('White', 'Black or African American', 'Asian', 'Native Hawaiian and Other Pacific Islander', 'American Indian and Alaska Native', 'Some other race'))
OR (subcategory1='two or more races' AND label IN ('White and Black or African American', 'White and American Indian and Alaska Native', 'White and Asian', 'Black or African American and American Indian and Alaska Native'))
ORDER BY Race

                                                Race  Projected_Deaths
0                  American Indian and Alaska Native       4482.362154
1                                              Asian      30816.239806
2                          Black or African American      71157.499189
3  Black or African American and American Indian ...        560.295269
4         Native Hawaiian and Other Pacific Islander       1120.590538
5                                    Some other race      27454.468191
6                                              White     406214.070172
7        White and American Indian and Alaska Native       3361.771615
8                                    White and Asian       3922.066884
9                White and Black or African American       5042.657423

#### Get the number of Americans actively affected by COVID-19 on January 10, 2021 and display the number of Americans by race (assuming that the total number of active cases is accurately split by the race percentages reported in demographics [focused on the subcategories with Hispanic or Latino/Not Hispanic or Latino])

In [10]:
%%bigquery
SELECT d.label AS Race, (d.percent/100)*
                                        (SELECT SUM(active)
                                        FROM datamart.cases AS c
                                        JOIN datamart.locations AS l ON c.location_id=l.id
                                        WHERE l.country='US' AND last_update between '2021-01-10' and '2021-01-10 23:59:59') AS Active_COVID_Cases
FROM datamart.demographics AS d
WHERE (subcategory1='Hispanic or Latino' AND label IN ('Mexican', 'Puerto Rican', 'Cuban', 'Other Hispanic or Latino'))
OR (subcategory1='Not Hispanic or Latino' AND label IN ('White alone', 'Black or African American alone', 'American Indian and Alaska Native alone', 'Asian alone', 'Native Hawaiian and Other Pacific Islander alone', 'Some other race alone', 'Two or more races'))
ORDER BY Race

                                                Race  Active_COVID_Cases
0            American Indian and Alaska Native alone    152345.802000000
1                                        Asian alone   1197002.730000000
2                    Black or African American alone   2676933.378000000
3                                              Cuban    152345.802000000
4                                            Mexican   2437532.832000000
5   Native Hawaiian and Other Pacific Islander alone     43527.372000000
6                           Other Hispanic or Latino    935838.498000000
7                                       Puerto Rican    369982.662000000
8                              Some other race alone     43527.372000000
9                                  Two or more races    522328.464000000
10                                       White alone  13210557.402000000

#### Get the number of estimated confirmed cases of working Americans affected by COVID-19 in 2021 (Jan 1 - April 14) per income group

In [26]:
%%bigquery
SELECT e.label AS Income, (e.percent/100)*
                                        ((SELECT SUM(confirmed)
                                        FROM datamart.cases AS c
                                        JOIN datamart.locations AS l ON c.location_id=l.id
                                        WHERE l.country='US' AND last_update between '2021-01-01' and '2021-04-14 23:59:59')
                            
                                        *
                                        (SELECT estimate FROM datamart.economics WHERE label = 'Workers 16 years and over')) AS Estimated_Confirmed_COVID_Cases
FROM datamart.economics AS e
WHERE (category = 'employment' AND subcategory= 'income')
ORDER BY Estimated_Confirmed_COVID_Cases DESC

                 Income Estimated_Confirmed_COVID_Cases
0    $50,000 to $74,999     74710568834605272.228000000
1  $100,000 to $149,999     65588929616426721.549000000
2    $75,000 to $99,999     55164199081365520.773000000
3    $35,000 to $49,999     53426743992188653.977000000
4    $15,000 to $24,999     38658375734185286.211000000
5    $25,000 to $34,999     38658375734185286.211000000
6      $200,000 or more     33446010466654685.823000000
7  $150,000 to $199,999     29536736516006735.532000000
8     Less than $10,000     26061826337653001.940000000
9    $10,000 to $14,999     18677642208651318.057000000

#### Get the estimated number of deaths on December 31, 2020 from COVID-19 per different ancestry of US residents based on percentage of population's ancestry and total confirmed deaths

In [29]:
%%bigquery
SELECT s.label AS Ancestry, (s.percent)*
                                        (SELECT AVG(deaths)
                                        FROM datamart.cases AS c
                                        JOIN datamart.locations AS l ON c.location_id=l.id
                                        WHERE l.country='US' AND last_update between '2020-12-31' and '2020-12-31 23:59:59') AS Estimated_Deaths
                                    
FROM datamart.social as s
WHERE (subcategory = 'ancestry')
ORDER BY Ancestry

                                          Ancestry  Estimated_Deaths
0                                         American        662.305212
1                                             Arab         64.094053
2                                            Czech         42.729368
3                                           Danish         42.729368
4                                            Dutch        128.188105
5                                          English        769.128633
6                           French (except Basque)        245.693869
7                                  French Canadian         64.094053
8                                           German       1420.751502
9                                            Greek         42.729368
10                                       Hungarian         42.729368
11                                           Irish       1036.187186
12                                         Italian        544.799448
13                                      Lithuanian         21.364684
14                                       Norwegian        138.870448
15                                          Polish        299.105579
16                                      Portuguese         42.729368
17                                         Russian         85.458737
18                                    Scotch-Irish         96.141079
19                                        Scottish        181.599816
20                                          Slovak         21.364684
21                              Subsaharan African        128.188105
22                                         Swedish        117.505763
23                                           Swiss         32.047026
24                                       Ukrainian         32.047026
25                                           Welsh         64.094053
26  West Indian (excluding Hispanic origin groups)         96.141079

### Views

#### Create BigQuery Dataset "reports"

In [12]:
!bq --location=US mk --dataset reports

Dataset 'lunar-analyzer-302702:reports' successfully created.

In [14]:
%%bigquery
CREATE VIEW reports.projected_april_14_2021_deaths_by_race AS
SELECT label AS Race, (d.percent/100)*(
                                        ((SELECT AVG(case_fatality_ratio)
                                        FROM datamart.cases
                                        WHERE last_update=(
                                        SELECT MAX(last_update)
                                        FROM datamart.cases AS c 
                                        JOIN datamart.locations AS l ON c.location_id=l.id 
                                        WHERE l.country='US' AND last_update between '2021-04-14' and '2021-04-14 23:59:59'))/100)
                                        *
                                        (((SELECT AVG(incident_rate) 
                                        FROM datamart.cases
                                        WHERE last_update=(
                                        SELECT MAX(last_update)
                                        FROM datamart.cases AS c 
                                        JOIN datamart.locations AS l ON c.location_id=l.id 
                                        WHERE l.country='US' AND last_update between '2021-04-14' and '2021-04-14 23:59:59'))/100000)*(SELECT estimate FROM datamart.demographics WHERE label='Total population'))
                                        ) AS Projected_Deaths
FROM datamart.demographics AS d
WHERE (subcategory1='one race' AND label IN ('White', 'Black or African American', 'Asian', 'Native Hawaiian and Other Pacific Islander', 'American Indian and Alaska Native', 'Some other race'))
OR (subcategory1='two or more races' AND label IN ('White and Black or African American', 'White and American Indian and Alaska Native', 'White and Asian', 'Black or African American and American Indian and Alaska Native'))
ORDER BY Race

Empty DataFrame
Columns: []
Index: []

In [ ]:
%%bigquery
CREATE VIEW reports.estimated_death_percentage_by_ancestry_dec3121 AS
%%bigquery
SELECT s.label AS Ancestry, (s.percent)*
                                        (SELECT AVG(deaths)
                                        FROM datamart.cases AS c
                                        JOIN datamart.locations AS l ON c.location_id=l.id
                                        WHERE l.country='US' AND last_update between '2020-12-31' and '2020-12-31 23:59:59') AS Estimated_Deaths
                                    
FROM datamart.social as s
WHERE (subcategory = 'ancestry')
ORDER BY Ancestry